/*************************************************************************
	> File Name: ptr_array.c
	> Author: 
	> Mail: 
	> Created Time: 2017年06月29日 星期四 13时58分51秒
 ************************************************************************/

#include<stdio.h>
int main(){
    int arr[][3]={{1,2,3},{4,5,6}};
    int (*p)[3]=arr;

    printf("arr[1][1]=%d\n",*(*(arr+1)+1));
    printf("arr[1][1]=%d\n",*(*(arr+2)-2));
    printf("arr[1][1]=%d\n",*(*(p+1)+1));
    printf("arr[1][2]=%d\n",*(*(arr+1)+2));
    printf("arr[1][2]=%d\n",*(*(arr+2)-1));
    printf("arr[1][2]=%d\n",*(*(p+1)+2));
    return 0;
}
